terjeio/grblHAL/drivers/ESP32/driver.c
/*
  driver.c - An embedded CNC Controller with rs274/ngc (g-code) support

  Driver code for ESP32

  Part of Grbl

  Copyright (c) 2018-2019 Terje Io

  Some parts
   Copyright (c) 2011-2015 Sungeun K. Jeon
   Copyright (c) 2009-2011 Simen Svale Skogsrud

  Grbl is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Grbl is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Grbl.  If not, see <http://www.gnu.org/licenses/>.
*/

#include <stdint.h>
#include <stdbool.h>

#include "GRBL/grbl.h"
#include "GRBL/report.h"

#include "driver.h"
#include "esp32-hal-uart.h"
#include "serial.h"
#include "nvs.h"
#include "esp_log.h"

#if WIFI_ENABLE
#include "wifi.h"
#include "TCPSTream.h"
#endif

#if BLUETOOTH_ENABLE
#include "bluetooth.h"
#endif

#if SDCARD_ENABLE
#include "sdcard/sdcard.h"
#include "esp_vfs_fat.h"
#endif

#if KEYPAD_ENABLE
#include "keypad/keypad.h"
#endif

#if IOEXPAND_ENABLE
#include "ioexpand.h"
#endif

#if EEPROM_ENABLE
#include "eeprom.h"
#endif

#ifdef I2C_PORT
#include "i2c.h"
#endif

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/timers.h"

// prescale step counter to 20Mhz
#define STEPPER_DRIVER_PRESCALER 4

#if PWM_RAMPED

#define SPINDLE_RAMP_STEP_INCR 20 // timer compare register change per ramp step
#define SPINDLE_RAMP_STEP_TIME 2  // ms

typedef struct {
    volatile uint32_t ms_cfg;
    volatile uint32_t ms_count;
    uint32_t pwm_current;
    uint32_t pwm_target;
    uint32_t pwm_step;
} pwm_ramp_t;

static pwm_ramp_t pwm_ramp;
#endif

driver_settings_t driver_settings;

typedef struct {
    uint8_t pin;
    uint8_t group;
    uint32_t mask;
    uint8_t offset;
    bool invert;
    volatile bool active;
    volatile bool debounce;
} state_signal_t;

const io_stream_t serial_stream = {
    .type = StreamSetting_Serial,
    .read = uartRead,
    .write = uartWriteS,
    .write_all = uartWriteS,
    .get_rx_buffer_available = uartRXFree,
    .reset_read_buffer = uartFlush,
    .cancel_read_buffer = uartCancel,
    .suspend_read = uartSuspendInput,
    .enqueue_realtime_command = protocol_enqueue_realtime_command
};

#if WIFI_ENABLE

void wifiStreamWriteS (const char *data)
{
	TCPStreamWriteS(data);
	uartWriteS(data);
}

const io_stream_t wifi_stream = {
    .type = StreamSetting_WiFi,
    .read = TCPStreamGetC,
    .write = TCPStreamWriteS,
    .write_all = wifiStreamWriteS,
    .get_rx_buffer_available = TCPStreamRxFree,
    .reset_read_buffer = TCPStreamRxFlush,
    .cancel_read_buffer = TCPStreamRxCancel,
    .suspend_read = uartSuspendInput,
    .enqueue_realtime_command = protocol_enqueue_realtime_command
};

#endif
#if BLUETOOTH_ENABLE
void btStreamWriteS (const char *data)
{
	BTStreamWriteS(data);
	uartWriteS(data);
}

const io_stream_t bluetooth_stream = {
    .type = StreamSetting_Bluetooth,
    .read = BTStreamGetC,
    .write = BTStreamWriteS,
    .write_all = btStreamWriteS,
    .get_rx_buffer_available = BTStreamRXFree,
    .reset_read_buffer = BTStreamFlush,
    .cancel_read_buffer = BTStreamCancel,
    .suspend_read = uartSuspendInput,
    .enqueue_realtime_command = protocol_enqueue_realtime_command
};

#endif


#define INPUT_GROUP_CONTROL 1
#define INPUT_GROUP_PROBE   2
#define INPUT_GROUP_LIMIT   4
#define INPUT_GROUP_KEYPAD  8

#define INPUT_RESET         0
#define INPUT_FEED_HOLD     1
#define INPUT_CYCLE_START   2
#define INPUT_SAFETY_DOOR   3
#define INPUT_PROBE         4
#define INPUT_LIMIT_X       5
#define INPUT_LIMIT_Y       6
#define INPUT_LIMIT_Z       7
#define INPUT_KEYPAD  		8

state_signal_t inputpin[] = {
    { .pin = RESET_PIN, .group = INPUT_GROUP_CONTROL },
    { .pin = FEED_HOLD_PIN, .group = INPUT_GROUP_CONTROL },
    { .pin = CYCLE_START_PIN, .group = INPUT_GROUP_CONTROL },
    { .pin = SAFETY_DOOR_PIN, .group = INPUT_GROUP_CONTROL },
    { .pin = PROBE_PIN, .group = INPUT_GROUP_PROBE },
    { .pin = X_LIMIT_PIN, .group = INPUT_GROUP_LIMIT },
    { .pin = Y_LIMIT_PIN, .group = INPUT_GROUP_LIMIT },
    { .pin = Z_LIMIT_PIN, .group = INPUT_GROUP_LIMIT }
#if KEYPAD_ENABLE
  , { .pin = KEYPAD_STROBE_PIN, .group = INPUT_GROUP_KEYPAD }
#endif
};

static volatile uint32_t ms_count = 1; // NOTE: initial value 1 is for "resetting" systick timer
static bool pwmEnabled = false, IOInitDone = false;
static spindle_pwm_t spindle_pwm;

// Inverts the probe pin state depending on user settings and probing cycle mode.
static uint8_t probe_invert;

#if IOEXPAND_ENABLE
static ioexpand_t iopins = {0};
#endif

static uint_fast16_t spindle_set_speed (uint_fast16_t pwm_value);

static portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;

static ledc_timer_config_t ledTimerConfig = {
	.speed_mode = LEDC_HIGH_SPEED_MODE,
	.duty_resolution = LEDC_TIMER_10_BIT,
	.timer_num = LEDC_TIMER_0,
	.freq_hz = (uint32_t)DEFAULT_SPINDLE_PWM_FREQ
};

static ledc_channel_config_t ledConfig = {
	.gpio_num = SPINDLEPWMPIN,
    .speed_mode = LEDC_HIGH_SPEED_MODE,
    .channel = LEDC_CHANNEL_0,
    .intr_type = LEDC_INTR_DISABLE,
    .timer_sel = LEDC_TIMER_0,
    .duty = 0,  /*!< LEDC channel duty, the range of duty setting is [0, (2**duty_resolution)] */
    .hpoint = 0
};
// Interrupt handler prototypes
static void stepper_driver_isr (void *arg);
static void gpio_isr (void *arg);

static TimerHandle_t xDelayTimer = NULL, debounceTimer = NULL;
static TaskHandle_t xStepperTask = NULL;

void selectStream (stream_setting_t stream)
{
	//
    switch(stream) {
#if BLUETOOTH_ENABLE
        case StreamSetting_Bluetooth:
            memcpy(&hal.stream, &bluetooth_stream, sizeof(io_stream_t));
            break;
#endif
#if WIFI_ENABLE
        case StreamSetting_WiFi:
            memcpy(&hal.stream, &wifi_stream, sizeof(io_stream_t));
        	hal.stream.write_all("[MSG:WIFI RUNNING]\r\n");
            break;
#endif
        case StreamSetting_Serial:
            memcpy(&hal.stream, &serial_stream, sizeof(io_stream_t));
            break;

        default:
        	break;
    }
}

