terjeio/grblHAL/drivers/ESP32/driver.c
    signals.reset = gpio_get_level(RESET_PIN);
    signals.feed_hold = gpio_get_level(FEED_HOLD_PIN);
    signals.cycle_start = gpio_get_level(CYCLE_START_PIN);
    signals.safety_door_ajar = gpio_get_level(SAFETY_DOOR_PIN);

    if(settings.control_invert.value)
        signals.value ^= settings.control_invert.value;

    return signals;
}

// Sets up the probe pin invert mask to
// appropriately set the pin logic according to setting for normal-high/normal-low operation
// and the probing cycle modes for toward-workpiece/away-from-workpiece.
static void probeConfigure(bool is_probe_away)
{
  probe_invert = settings.flags.invert_probe_pin ? 0 : 1;

  if(is_probe_away)
      probe_invert ^= 1;
#if PROBE_ISR
	gpio_set_intr_type(inputpin[INPUT_PROBE].pin, probe_invert ? GPIO_INTR_NEGEDGE : GPIO_INTR_POSEDGE);
	inputpin[INPUT_PROBE].active = false;
#endif
}

// Returns the probe pin state. Triggered = true.
bool probeGetState (void)
{
#if PROBE_ISR
	// TODO: verify!
	inputpin[INPUT_PROBE].active = inputpin[INPUT_PROBE].active || ((uint8_t)gpio_get_level(PROBE_PIN) ^ probe_invert);
    return inputpin[INPUT_PROBE].active;
#else
    return (uint8_t)gpio_get_level(PROBE_PIN) ^ probe_invert;
#endif
}

// Static spindle (off, on cw & on ccw)
inline static void spindle_off ()
{
#if IOEXPAND_ENABLE
	iopins.spindle_on = settings.spindle.invert.on ? On : Off;
	ioexpand_out(iopins);
#else
    gpio_set_level(SPINDLE_ENABLE_PIN, settings.spindle.invert.on ? 1 : 0);
#endif
}

inline static void spindle_on ()
{
#if IOEXPAND_ENABLE
	iopins.spindle_on = settings.spindle.invert.on ? Off : On;
	ioexpand_out(iopins);
#else
   gpio_set_level(SPINDLE_ENABLE_PIN, settings.spindle.invert.on ? 0 : 1);
#endif
}

inline static void spindle_dir (bool ccw)
{
	if(hal.driver_cap.spindle_dir) {
#if IOEXPAND_ENABLE
		iopins.spindle_dir = (ccw ^ settings.spindle.invert.ccw) ? On : Off;
		ioexpand_out(iopins);
#else
		gpio_set_level(SPINDLE_DIRECTION_PIN, (ccw ^ settings.spindle.invert.ccw) ? 1 : 0);
#endif
	}
}

// Start or stop spindle
static void spindleSetState (spindle_state_t state, float rpm)
{
    if (!state.on)
        spindle_off();
    else {
        spindle_dir(state.ccw);
        spindle_on();
    }
}

// Variable spindle control functions

// Sets spindle speed
static uint_fast16_t spindle_set_speed (uint_fast16_t pwm_value)
{
    if (pwm_value == spindle_pwm.off_value) {
        if(settings.spindle.disable_with_zero_speed)
            spindle_off();
#if PWM_RAMPED
        pwm_ramp.pwm_target = pwm_value;
        ledc_set_fade_step_and_start(ledConfig.speed_mode, ledConfig.channel, pwm_ramp.pwm_target, 1, 4, LEDC_FADE_NO_WAIT);
#else
        ledc_stop(ledConfig.speed_mode, ledConfig.channel, 0);
#endif
        pwmEnabled = false;
     } else {
#if PWM_RAMPED
    	 pwm_ramp.pwm_target = pwm_value;
    	 ledc_set_fade_step_and_start(ledConfig.speed_mode, ledConfig.channel, pwm_ramp.pwm_target, 1, 4, LEDC_FADE_NO_WAIT);
#else
    	 ledc_set_duty(ledConfig.speed_mode, ledConfig.channel, pwm_value);
    	 ledc_update_duty(ledConfig.speed_mode, ledConfig.channel);
#endif
        if(!pwmEnabled) {
            spindle_on();
            pwmEnabled = true;
        }
    }

    return pwm_value;
}

static void spindleUpdateRPM (float rpm)
{
    spindle_set_speed(spindle_compute_pwm_value(&spindle_pwm, rpm, false));
}

// Start or stop spindle, variable version
static void spindleSetStateVariable (spindle_state_t state, float rpm)
{
    if (!state.on || rpm == 0.0f) {
        spindle_set_speed(spindle_pwm.off_value);
        spindle_off();
    } else {
        spindle_dir(state.ccw);
        spindle_set_speed(spindle_compute_pwm_value(&spindle_pwm, rpm, false));
    }
}

// Returns spindle state in a spindle_state_t variable
static spindle_state_t spindleGetState (void)
{
    spindle_state_t state = {0};

#if IOEXPAND_ENABLE // TODO: read from expander?
	state.on = iopins.spindle_on;
	state.ccw = hal.driver_cap.spindle_dir && iopins.spindle_dir;
#else
    state.on = gpio_get_level(SPINDLE_ENABLE_PIN) != 0;
    state.ccw = hal.driver_cap.spindle_dir && gpio_get_level(SPINDLE_DIRECTION_PIN) != 0;
#endif
    state.value ^= settings.spindle.invert.mask;
    state.on |= pwmEnabled;

#if PWM_RAMPED
    state.at_speed = ledc_get_duty(ledConfig.speed_mode, ledConfig.channel) == pwm_ramp.pwm_target;
#endif
    return state;
}

// end spindle code

// Start/stop coolant (and mist if enabled)
static void coolantSetState (coolant_state_t mode)
{
    mode.value ^= settings.coolant_invert.mask;
#if IOEXPAND_ENABLE
	iopins.flood_on = mode.flood;
	iopins.mist_on = mode.mist;
	ioexpand_out(iopins);
#else
    gpio_set_level(COOLANT_FLOOD_PIN, mode.flood ? 1 : 0);
    gpio_set_level(COOLANT_MIST_PIN, mode.mist ? 1 : 0);
#endif
}

// Returns coolant state in a coolant_state_t variable
static coolant_state_t coolantGetState (void)
{
    coolant_state_t state = {0};

#if IOEXPAND_ENABLE // TODO: read from expander?
	state.flood = iopins.flood_on;
	state.mist = iopins.mist_on;
#else
    state.flood = gpio_get_level(COOLANT_FLOOD_PIN);
    state.mist  = gpio_get_level(COOLANT_MIST_PIN);
#endif

    state.value ^= settings.coolant_invert.mask;

    return state;
}

static void showMessage (const char *msg)
{
    hal.stream.write("[MSG:");
    hal.stream.write(msg);
    hal.stream.write("]\r\n");
}

// Helper functions for setting/clearing/inverting individual bits atomically (uninterruptable)
IRAM_ATTR static void bitsSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
	portENTER_CRITICAL(&mux);
    *ptr |= bits;
    portEXIT_CRITICAL(&mux);
}

IRAM_ATTR static uint_fast16_t bitsClearAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
	portENTER_CRITICAL(&mux);
    uint_fast16_t prev = *ptr;
    *ptr &= ~bits;
    portEXIT_CRITICAL(&mux);
    return prev;
}

IRAM_ATTR static uint_fast16_t valueSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t value)
{
	portENTER_CRITICAL(&mux);
    uint_fast16_t prev = *ptr;
    *ptr = value;
    portEXIT_CRITICAL(&mux);
    return prev;
}

