terjeio/grblHAL/drivers/ESP32/driver.c
void debounceTimerCallback (TimerHandle_t xTimer)
{
	  uint8_t grp = 0;

	  uint32_t i = sizeof(inputpin) / sizeof(state_signal_t);
	  do {
	      i--;
	      if(inputpin[i].debounce && inputpin[i].active) {
	    	  inputpin[i].active = false; //gpio_get_level(inputpin[i].pin) == (inputpin[i].invert ? 0 : 1);
	    	  grp |= inputpin[i].group;
	      }
	  } while(i);

//	  printf("Debounce %d %d\n", grp, systemGetState().value);

	  if(grp & INPUT_GROUP_LIMIT)
		    hal.limit_interrupt_callback(limitsGetState());

	  if(grp & INPUT_GROUP_CONTROL)
		  hal.control_interrupt_callback(systemGetState());
}



// Configures perhipherals when settings are initialized or changed
static void settings_changed (settings_t *settings)
{
    if((hal.driver_cap.variable_spindle = settings->spindle.rpm_max > settings->spindle.rpm_min)) {
		uint32_t pwm_max_value = (1UL << ledTimerConfig.duty_resolution) - 1;

		spindle_pwm.period = (uint32_t)(80000000UL / settings->spindle.pwm_freq);
		spindle_pwm.off_value = settings->spindle.invert.pwm ? spindle_pwm.period : 0;
		spindle_pwm.min_value = (uint32_t)(pwm_max_value * settings->spindle.pwm_min_value / 100.0f);
		spindle_pwm.max_value = (uint32_t)(pwm_max_value * settings->spindle.pwm_max_value / 100.0f);
		spindle_pwm.pwm_gradient = (float)(spindle_pwm.max_value - spindle_pwm.min_value) / (settings->spindle.rpm_max - settings->spindle.rpm_min);

		ledc_set_freq(ledTimerConfig.speed_mode, ledTimerConfig.timer_num, (uint32_t)settings->spindle.pwm_freq);
    }

    if(IOInitDone) {

	  #if TRINAMIC_ENABLE
	    trinamic_configure();
	  #endif

	    hal.spindle_set_state = hal.driver_cap.variable_spindle ? spindleSetStateVariable : spindleSetState;

    	// Validate stream setting, switch to serial if not supported
    	if((settings->stream == StreamSetting_WiFi && !hal.driver_cap.wifi) ||
        	(settings->stream == StreamSetting_Bluetooth && !hal.driver_cap.bluetooth))
    		settings->stream = StreamSetting_Serial;

    	// NOTE: some interfaces may defer actual stream switch until stack is operational
    	switch(settings->stream) {

    		case StreamSetting_Serial:
    			selectStream(StreamSetting_Serial);
    			break;

#if WIFI_ENABLE
    		case StreamSetting_WiFi:;
				static bool wifi_ok = false;
				if(!wifi_ok && driver_settings.wifi.ssid[0] != '\0')
					wifi_ok = wifi_init(&driver_settings.wifi);
					// else report error?
				break;
#endif

#if BLUETOOTH_ENABLE
    		case StreamSetting_Bluetooth:;
    			static bool bluetooth_ok = false;
    			if(!bluetooth_ok && driver_settings.bluetooth.device_name[0] != '\0')
					bluetooth_ok = bluetooth_init(&driver_settings.bluetooth);
				// else report error?
#endif
    		default:
    			break;
    	}

        stepperEnable(settings->steppers.deenergize);

        /*********************
         * Step pulse config *
         *********************/

        initRMT(settings);

        /****************************************
         *  Control, limit & probe pins config  *
         ****************************************/

        bool pullup = true;
        control_signals_t control_fei;
        gpio_config_t config;

        control_fei.mask = settings->control_disable_pullup.mask ^ settings->control_invert.mask;

        axes_signals_t limit_fei;
        limit_fei.mask = settings->limits.disable_pullup.mask ^ settings->limits.invert.mask;

        uint32_t i = sizeof(inputpin) / sizeof(state_signal_t);

        do {

            config.intr_type = GPIO_INTR_DISABLE;

        	switch(--i) {

                case INPUT_RESET:
                    pullup = !settings->control_disable_pullup.reset;
                    inputpin[i].invert = control_fei.reset;
                    config.intr_type = inputpin[i].invert ? GPIO_INTR_NEGEDGE : GPIO_INTR_POSEDGE;
                    break;

                case INPUT_FEED_HOLD:
                    pullup = !settings->control_disable_pullup.feed_hold;
                    inputpin[i].invert = control_fei.feed_hold;
                    config.intr_type = inputpin[i].invert ? GPIO_INTR_NEGEDGE : GPIO_INTR_POSEDGE;
                    break;

                case INPUT_CYCLE_START:
                    pullup = !settings->control_disable_pullup.cycle_start;
                    inputpin[i].invert = control_fei.cycle_start;
                    config.intr_type = inputpin[i].invert ? GPIO_INTR_NEGEDGE : GPIO_INTR_POSEDGE;
                    break;

                case INPUT_SAFETY_DOOR:
                    pullup = !settings->control_disable_pullup.safety_door_ajar;
                    inputpin[i].invert = control_fei.safety_door_ajar;
                    config.intr_type = inputpin[i].invert ? GPIO_INTR_NEGEDGE : GPIO_INTR_POSEDGE;
                    break;

                case INPUT_PROBE:
                    pullup = hal.driver_cap.probe_pull_up;
                    inputpin[i].invert = false;
                    break;

                case INPUT_LIMIT_X:
                    pullup = !settings->limits.disable_pullup.x;
                    inputpin[i].invert = limit_fei.x;
                    break;

                case INPUT_LIMIT_Y:
                    pullup = !settings->limits.disable_pullup.y;
                    inputpin[i].invert = limit_fei.y;
                    break;

                case INPUT_LIMIT_Z:
                    pullup = !settings->limits.disable_pullup.z;
                    inputpin[i].invert = limit_fei.z;
                    break;

#if KEYPAD_ENABLE
                case INPUT_KEYPAD:
                    pullup = true;
                    inputpin[i].invert = false;
                    config.intr_type = GPIO_INTR_ANYEDGE;
                    break;
#endif
            }

        	if(inputpin[i].pin != 0xFF) {
				pullup = pullup && inputpin[i].pin < 34;

				gpio_intr_disable(inputpin[i].pin);

				config.pin_bit_mask = 1ULL << inputpin[i].pin;
				config.mode = GPIO_MODE_INPUT;
				config.pull_up_en = pullup ? GPIO_PULLUP_ENABLE : GPIO_PULLUP_DISABLE;
				config.pull_down_en = pullup ? GPIO_PULLDOWN_DISABLE : GPIO_PULLDOWN_ENABLE;

				inputpin[i].offset = config.pin_bit_mask > (1ULL << 31) ? 1 : 0;
				inputpin[i].mask = inputpin[i].offset == 0 ? (uint32_t)config.pin_bit_mask : (uint32_t)(config.pin_bit_mask >> 32);

	//            printf("IN %d - %d - %d : %x\n", inputpin[i].pin,  inputpin[i].offset, inputpin[i].mask, inputpin[i].invert);

				gpio_config(&config);

				inputpin[i].active   = gpio_get_level(inputpin[i].pin) == (inputpin[i].invert ? 0 : 1);
				inputpin[i].debounce = hal.driver_cap.software_debounce && !(inputpin[i].group == INPUT_GROUP_PROBE || inputpin[i].group == INPUT_GROUP_KEYPAD);
        	}
        } while(i);
    }
}

void vStepperTask (void *pvParameters)
{
	while(true) {
		vTaskSuspend(NULL);
		hal.stepper_interrupt_callback();
	}
}

// Initializes MCU peripherals for Grbl use
static bool driver_setup (settings_t *settings)
{
	/********************************************************
	 * Read driver specific setting from persistent storage *
	 ********************************************************/

