terjeio/grblHAL/drivers/ESP32/driver.c
	if(hal.eeprom.type != EEPROM_None) {
		if(!hal.eeprom.memcpy_from_with_checksum((uint8_t *)&driver_settings, hal.eeprom.driver_area.address, sizeof(driver_settings)))
			hal.driver_settings_restore(SETTINGS_RESTORE_DRIVER_PARAMETERS);
		#if TRINAMIC_ENABLE && CNC_BOOSTERPACK // Trinamic BoosterPack does not support mixed drivers
		  driver_settings.trinamic.driver_enable.mask = AXES_BITMASK;
		#endif
	}

    /******************
     *  Stepper init  *
     ******************/

	timer_config_t timerConfig = {
		.divider     = STEPPER_DRIVER_PRESCALER,
		.counter_dir = TIMER_COUNT_UP,
		.counter_en  = TIMER_PAUSE,
		.alarm_en    = TIMER_ALARM_EN,
		.intr_type   = TIMER_INTR_LEVEL,
		.auto_reload = true
	};

	timer_init(STEP_TIMER_GROUP, STEP_TIMER_INDEX, &timerConfig);
	timer_set_counter_value(STEP_TIMER_GROUP, STEP_TIMER_INDEX, 0ULL);
	timer_isr_register(STEP_TIMER_GROUP, STEP_TIMER_INDEX, stepper_driver_isr, 0, ESP_INTR_FLAG_IRAM, NULL);
	timer_enable_intr(STEP_TIMER_GROUP, STEP_TIMER_INDEX);

	xTaskCreatePinnedToCore(vStepperTask, "Stepper", configMINIMAL_STACK_SIZE, NULL, configMAX_PRIORITIES, &xStepperTask, 1);

    /********************
     *  Output signals  *
     ********************/

    uint32_t channel;
    for(channel = 0; channel < N_AXIS; channel++)
        rmt_set_source_clk(channel, RMT_BASECLK_APB);

    gpio_config_t gpioConfig = {
#if IOEXPAND_ENABLE
		.pin_bit_mask = DIRECTION_MASK,
#else
		.pin_bit_mask = DIRECTION_MASK|STEPPERS_DISABLE_MASK|SPINDLE_MASK|COOLANT_MASK,
#endif
		.mode = GPIO_MODE_OUTPUT,
		.pull_up_en = GPIO_PULLUP_DISABLE,
		.pull_down_en = GPIO_PULLDOWN_DISABLE,
		.intr_type = GPIO_INTR_DISABLE
    };

    gpio_config(&gpioConfig);

   /****************************
    *  Software debounce init  *
    ****************************/

    if(hal.driver_cap.software_debounce)
        debounceTimer = xTimerCreate("msDelay", pdMS_TO_TICKS(32), pdFALSE, NULL, debounceTimerCallback);

    /******************************************
     *  Control, limit & probe pins dir init  *
     ******************************************/

    gpio_isr_register(gpio_isr, NULL, (int)ESP_INTR_FLAG_IRAM, NULL);

   /******************
    *  Spindle init  *
    ******************/

#if PWM_RAMPED
    ledc_fade_func_install(ESP_INTR_FLAG_IRAM);
#endif
	ledConfig.speed_mode = ledTimerConfig.speed_mode;
	ledc_timer_config(&ledTimerConfig);
	ledc_channel_config(&ledConfig);

	/**/

#if SDCARD_ENABLE

    sdmmc_host_t host = SDSPI_HOST_DEFAULT();
    sdspi_slot_config_t slot_config = SDSPI_SLOT_CONFIG_DEFAULT();
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,
        .max_files = 5
//        .allocation_unit_size = 16 * 1024
    };

    slot_config.gpio_miso = PIN_NUM_MISO;
    slot_config.gpio_mosi = PIN_NUM_MOSI;
    slot_config.gpio_sck  = PIN_NUM_CLK;
    slot_config.gpio_cs   = PIN_NUM_CS;

    host.max_freq_khz = 20000; //SDMMC_FREQ_DEFAULT; //SDMMC_FREQ_PROBING; 19000;

    sdmmc_card_t* card;
    esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config, &mount_config, &card);

    sdcard_init();
#endif

#if IOEXPAND_ENABLE
    ioexpand_init();
#endif

#if KEYPAD_ENABLE
//    keypad_init();
#endif

#if TRINAMIC_ENABLE
    trinamic_init();
#endif

  // Set defaults

    IOInitDone = settings->version == 14;

    settings_changed(settings);

    hal.stepper_go_idle(true);
    hal.spindle_set_state((spindle_state_t){0}, 0.0f);
    hal.coolant_set_state((coolant_state_t){0});

    return IOInitDone;
}

static bool driver_setting (uint_fast16_t param, float value, char *svalue)
{
	bool claimed = false;

	if(svalue) switch(param) {

		case Settings_WiFiSSID:
			claimed = strlcpy(driver_settings.wifi.ssid, svalue, sizeof(driver_settings.wifi.ssid)) <= sizeof(driver_settings.wifi.ssid);
			break;

		case Settings_WiFiPassword:
			claimed = strlcpy(driver_settings.wifi.password, svalue, sizeof(driver_settings.wifi.password)) <= sizeof(driver_settings.wifi.password);
			break;

		case Settings_WiFiPort:
			if((claimed = (value != NAN && value > 0.0f && value < 65536.0f)))
				driver_settings.wifi.port = (uint16_t)value;
			break;

		case Settings_BlueToothDeviceName:
			claimed = strlcpy(driver_settings.bluetooth.device_name, svalue, sizeof(driver_settings.bluetooth.device_name)) <= sizeof(driver_settings.bluetooth.device_name);
			break;

		case Settings_BlueToothServiceName:
			claimed = strlcpy(driver_settings.bluetooth.service_name, svalue, sizeof(driver_settings.bluetooth.service_name)) <= sizeof(driver_settings.bluetooth.service_name);
			break;
	}

#if KEYPAD_ENABLE
	if(!claimed)
		claimed = keypad_setting(param, value, svalue);
#endif

#if TRINAMIC_ENABLE
    if(!claimed)
        claimed = trinamic_setting(param, value, svalue);
#endif

	if(claimed)
		hal.eeprom.memcpy_to_with_checksum(hal.eeprom.driver_area.address, (uint8_t *)&driver_settings, sizeof(driver_settings));

    return claimed;
}

#ifdef DRIVER_SETTINGS

static void report_string_setting (uint8_t setting, char *value)
{
    hal.stream.write("$");
    hal.stream.write(uitoa((uint32_t)setting));
    hal.stream.write("=");
    hal.stream.write(value);
    hal.stream.write("\r\n");
}

static void driver_settings_report (bool axis_settings, axis_setting_type_t setting_type, uint8_t axis_idx)
{
    if(!axis_settings) {
#if KEYPAD_ENABLE
    	keypad_settings_report(axis_settings, setting_type, axis_idx);
#endif
#if WIFI_ENABLE
		report_string_setting(Settings_WiFiSSID, driver_settings.wifi.ssid);
		report_string_setting(Settings_WiFiPassword, driver_settings.wifi.password);
		report_uint_setting(Settings_WiFiPort, driver_settings.wifi.port);
#endif
#if BLUETOOTH_ENABLE
		report_string_setting(Settings_BlueToothDeviceName, driver_settings.bluetooth.device_name);
		report_string_setting(Settings_BlueToothServiceName, driver_settings.bluetooth.service_name);
#endif
    }
#if TRINAMIC_ENABLE
    trinamic_settings_report(axis_settings, setting_type, axis_idx);
#endif
}

void driver_settings_restore (uint8_t restore_flag)
{
    if(restore_flag & SETTINGS_RESTORE_DRIVER_PARAMETERS) {
    	driver_settings.wifi.ssid[0] = '\0';
    	driver_settings.wifi.password[0] = '\0';
    	driver_settings.wifi.port = 23;
    	strcpy(driver_settings.bluetooth.device_name, "GRBL");
    	strcpy(driver_settings.bluetooth.service_name, "GRBL Serial Port");
#if KEYPAD_ENABLE
    	keypad_settings_restore(restore_flag);
#endif
#if TRINAMIC_ENABLE
        trinamic_settings_restore(restore_flag);
#endif
    	hal.eeprom.memcpy_to_with_checksum(hal.eeprom.driver_area.address, (uint8_t *)&driver_settings, sizeof(driver_settings));
    }
}

#endif

// Initialize HAL pointers, setup serial comms and enable EEPROM
// NOTE: Grbl is not yet configured (from EEPROM data), driver_setup() will be called when done
bool driver_init (void)
{
    // Enable EEPROM and serial port here for Grbl to be able to configure itself and report any errors

    uartInit();

#ifdef I2C_PORT
	I2CInit();
#endif

    hal.info = "ESP32";
    hal.driver_setup = driver_setup;
    hal.f_step_timer = rtc_clk_apb_freq_get() / STEPPER_DRIVER_PRESCALER; // 20 MHz
    hal.rx_buffer_size = RX_BUFFER_SIZE;
    hal.delay_ms = driver_delay_ms;
    hal.settings_changed = settings_changed;

    hal.stepper_wake_up = stepperWakeUp;
    hal.stepper_go_idle = stepperGoIdle;
    hal.stepper_enable = stepperEnable;
    hal.stepper_cycles_per_tick = stepperCyclesPerTick;
    hal.stepper_pulse_start = stepperPulseStart;

    hal.limits_enable = limitsEnable;
    hal.limits_get_state = limitsGetState;

    hal.coolant_set_state = coolantSetState;
    hal.coolant_get_state = coolantGetState;

#if PROBE_ENABLE
    hal.probe_get_state = probeGetState;
    hal.probe_configure_invert_mask = probeConfigure;
#endif

