terjeio/grblHAL/drivers/ESP32/driver.c
    hal.spindle_set_state = spindleSetState;
    hal.spindle_get_state = spindleGetState;
    hal.spindle_update_rpm = spindleUpdateRPM;

    hal.system_control_get_state = systemGetState;

    selectStream(StreamSetting_Serial);

#if EEPROM_ENABLE
    hal.eeprom.type = EEPROM_Physical;
    hal.eeprom.get_byte = eepromGetByte;
    hal.eeprom.put_byte = eepromPutByte;
    hal.eeprom.memcpy_to_with_checksum = eepromWriteBlockWithChecksum;
    hal.eeprom.memcpy_from_with_checksum = eepromReadBlockWithChecksum;
#else
    if(nvsInit()) {
        hal.eeprom.type = EEPROM_Emulated;
        hal.eeprom.memcpy_from_flash = nvsRead;
        hal.eeprom.memcpy_to_flash = nvsWrite;
	} else
	    hal.eeprom.type = EEPROM_None;
#endif

#ifdef DRIVER_SETTINGS

    if(hal.eeprom.type != EEPROM_None) {
		hal.eeprom.driver_area.address = GRBL_EEPROM_SIZE;
		hal.eeprom.driver_area.size = sizeof(driver_settings); // Add assert?
		hal.eeprom.size = GRBL_EEPROM_SIZE + sizeof(driver_settings) + 1;

		hal.driver_setting = driver_setting;
		hal.driver_settings_report = driver_settings_report;
		hal.driver_settings_restore = driver_settings_restore;
    }
#endif

    hal.set_bits_atomic = bitsSetAtomic;
    hal.clear_bits_atomic = bitsClearAtomic;
    hal.set_value_atomic = valueSetAtomic;

    hal.show_message = showMessage;

#ifdef DEBUGOUT
    hal.debug_out = debug_out;
#endif

#if KEYPAD_ENABLE
    hal.execute_realtime = keypad_process_keypress;
#endif

#if SDCARD_ENABLE
    hal.driver_reset = sdcard_reset;
#endif

#if TRINAMIC_ENABLE
    hal.user_mcode_check = trinamic_MCodeCheck;
    hal.user_mcode_validate = trinamic_MCodeValidate;
    hal.user_mcode_execute = trinamic_MCodeExecute;
    hal.driver_rt_report = trinamic_RTReport;
#endif

  // driver capabilities, used for announcing and negotiating (with Grbl) driver functionality

    hal.driver_cap.spindle_dir = On;
    hal.driver_cap.variable_spindle = On;
#if PWM_RAMPED
    hal.driver_cap.spindle_at_speed = On;
#endif
    hal.driver_cap.mist_control = On;
    hal.driver_cap.software_debounce = On;
    hal.driver_cap.step_pulse_delay = On;
    hal.driver_cap.amass_level = 3;
    hal.driver_cap.control_pull_up = On;
    hal.driver_cap.limits_pull_up = On;
    hal.driver_cap.probe_pull_up = On;
#if SDCARD_ENABLE
    hal.driver_cap.sd_card = On;
#endif
#if BLUETOOTH_ENABLE
    hal.driver_cap.bluetooth = On;
#endif
#if WIFI_ENABLE
    hal.driver_cap.wifi = On;
#endif

   // no need to move version check before init - compiler will fail any mismatch for existing entries
    return hal.version == 5;
}

/* interrupt handlers */

// Main stepper driver
IRAM_ATTR static void stepper_driver_isr (void *arg)
{
//	const int timer_idx = (int)arg;  // get the timer index

	TIMERG0.int_clr_timers.t0 = 1;
  	TIMERG0.hw_timer[STEP_TIMER_INDEX].config.alarm_en = TIMER_ALARM_EN;

    /* Resume the suspended task. */

    /* A context switch should now be performed so the ISR returns directly to
    the resumed task. This is because the resumed task had a priority that
    was equal to or higher than the task that is currently in the Running state.
    NOTE: The syntax required to perform a context switch from an ISR varies
    from port to port and from compiler to compiler. Check the
    documentation and examples for the port being used to find the syntax required by your
    application. It is likely that this if() statement can be replaced by a
    single call to portYIELD_FROM_ISR() [or portEND_SWITCHING_ISR()]
    using xYieldRequired as the macro parameter: portYIELD_FROM_ISR( xYieldRequired );*/

	hal.stepper_interrupt_callback();

//    if(xTaskResumeFromISR(xStepperTask) == pdTRUE)
//         portYIELD_FROM_ISR();
}

  //GPIO intr process
IRAM_ATTR static void gpio_isr (void *arg)
{
  bool debounce = false;
  uint8_t grp = 0;
  uint32_t intr_status[2];
  intr_status[0] = READ_PERI_REG(GPIO_STATUS_REG);			// get interrupt status for GPIO0-31
  intr_status[1] = READ_PERI_REG(GPIO_STATUS1_REG);			// get interrupt status for GPIO32-39
  SET_PERI_REG_MASK(GPIO_STATUS_W1TC_REG, intr_status[0]);  // clear intr for gpio0-gpio31
  SET_PERI_REG_MASK(GPIO_STATUS1_W1TC_REG, intr_status[1]);	// clear intr for gpio32-39

  uint32_t i = sizeof(inputpin) / sizeof(state_signal_t);
  do {
      i--;
	  if(intr_status[inputpin[i].offset] & inputpin[i].mask) {
		  inputpin[i].active = true;
		  if(inputpin[i].debounce)
			  debounce = true;
		  else
			  grp |= inputpin[i].group;
      }
  } while(i);

  if(debounce) {
      BaseType_t xHigherPriorityTaskWoken = pdFALSE;
      xTimerStartFromISR(debounceTimer, &xHigherPriorityTaskWoken);
  }

  if(grp & INPUT_GROUP_LIMIT)
	  hal.limit_interrupt_callback(limitsGetState());

  if(grp & INPUT_GROUP_CONTROL)
	  hal.control_interrupt_callback(systemGetState());

#if KEYPAD_ENABLE
  if(grp & INPUT_GROUP_KEYPAD)
	  keypad_keyclick_handler(gpio_get_level(inputpin[INPUT_KEYPAD].pin));
#endif
}
